Revit 2027 API
BuiltInFailures.RebarCouplerFailures.WidthParameterError Property
 This is used to post error.The "External Diameter" parameter must be set to a strictly positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WidthParameterError { get; }
Public Shared ReadOnly Property WidthParameterError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WidthParameterError {
	FailureDefinitionId^ get ();
}
static member WidthParameterError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace